package com.thanu.yogasanam;

import android.app.Activity;
import android.content.Intent;
import android.graphics.Typeface;
import android.os.Bundle;
import android.text.Html;
import android.view.MotionEvent;
import android.view.View;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.ScrollView;
import android.widget.TextView;
import android.widget.Toast;

import com.mayuonline.tamilandroidunicodeutil.TamilUtil;
import com.thanu.yogasanam.SimpleGestureFilter.SimpleGestureListener;

public class DetailActivity extends Activity implements View.OnClickListener,
		SimpleGestureListener {

	Intent yogaIntent;
	Bundle bundleName;
	String yogaName = "";
	TextView content;
	ImageView yogaImage;
	TextView title;
	Intent video;
	Boolean stopIndicator = false;

	/*
	 * VideoView myVideoView; private ProgressDialog progressDialog; private
	 * MediaController mediaControls; private int position = 0;
	 */
	Button playVideo;
	Typeface tf;
	private SimpleGestureFilter detector;
	private ScrollView scroll;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.activity_detail);
		setTitle("Yogasanam");
		yogaIntent = getIntent();
		bundleName = yogaIntent.getExtras();
		yogaName = bundleName.getString("indexValue");
		playVideo = (Button) findViewById(R.id.play);
		playVideo.setOnClickListener(this);
		tf = Typeface.createFromAsset(getAssets(), "fonts/SaiVrishintscii.ttf");

		content = (TextView) findViewById(R.id.textView1);
		title = (TextView) findViewById(R.id.title);
		yogaImage = (ImageView) findViewById(R.id.imageView1);
		content.setTypeface(tf);
		scroll = (ScrollView)findViewById(R.id.scroll);
		detector = new SimpleGestureFilter(this, this);
		title.setTypeface(tf);
		settingValue();

	}

	private void settingValue() {
		if (yogaName.equals("yoga_1")) {
			playVideo.setVisibility(Button.VISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga1)));
			yogaImage.setImageResource(R.drawable.yoga_1);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							" எந்த ஒரு  ஆசனம் செய்வதற்கு முன்பும் <b>"
									+ "சூரிய நமஸ்காரம்</b> செய்வது மிகவும் முக்கியம். "
									+ "சூரிய நமஸ்காரம் என்பது  மந்திரமும் ஆசனமும் சேர்ந்த ஒரு அபூர்வ அதிசக்தி அளிக்கும் படைப்பாகும்."
									+ "உடல் சிறப்புற சூரிய நமஸ்காரம் என்ற ஆசனத்தில் 10 வகையில் உடல் நிலைகளை வைக்கும் ஆசனங்கள் உள்ளன."
									+ " சூரிய நமஸ்காரம் செய்தபின் இயல்பான மூச்சு வரும் வரை ஓய்வெடுக்க வேண்டும். "
									+ "அதன் பின்னரே மற்ற ஆசனங்கள் செய்ய வேண்டும்."
									+ "<br/>சூரிய நமஸ்காரம் தினமும் செய்வதன் மூலம் நம் உடலுக்கு தேவையான பல்வேறு சக்திகள் கிடைக்கின்றன. சூரிய நமஸ்காரத்தில் உடல் அசைவுகளும், மூச்சு ஓட்டமும் இணக்கமாக நடைபெறுகின்றன. நுரையீரல்களில் காற்றோட்டம் தாராளமாகிறது. ஏராளமான கரியமில வாயுவும், பிற நச்சுப் பொருள்களும் மூச்சு மண்டலத்திலிருந்து வெளியேற்றப்படுகின்றன."
									+ "<br/>ஜீரண மண்டலத்திற்கு கூடுதல் சக்தி கிடைக்கிறது. கல்லீரல், வயிறு, மண்ணீரல், குடல்கள் எல்லாம் நன்றாக மசாஜ் செய்யப்படுகின்றன. இதனால் மலச்சிக்கல் பிரச்சினைக்கு இடமில்லாமல் போகிறது. மேலும், வயிற்று உறுப்புக்களில் ரத்தம் தங்குவதில்லை என்பதால் உடல் உறுதியாகிறது. இவற்றோடு, சிறப்பு பலனாக நம் நினைவாற்றல் அதிகரிக்கிறது. "
									+ "<br/>அதாவது, தொடர்ந்து சூரிய நமஸ்காரம் செய்து வந்தால் ரத்தக் கொதிப்பு மட்டுப்படுத்தப்படுகிறது. இதயத் துடிப்பும் சீராகிறது. நரம்புகளின் செயல்களை நெறிப்படுத்துவதன் மூலம் நல்ல ஓய்வுக்கும், உறக்கத்திற்கும் இது உதவுகின்றது. இதனால் நினைவாற்றல் அதிகரிக்கின்றது. உடல் பொலிவுக்கும் சூரிய நமஸ்காரம் பயன்படுகிறது."
									+ "<br/>சூரிய நமஸ்காரத்தை சிறந்த முறையில் கற்க வீடியோ தொகுப்பு சேர்க்கப்பட்டுளது")));

		} else if (yogaName.equals("yoga_2")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga2)));
			yogaImage.setImageResource(R.drawable.yoga_2);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை</b>"
									+ "<br/>1.முதலில் விரிப்பில் நேராக நின்று கொள்ளவும். பின்னர் குதிக்கால் தரையில் இருக்க உடலை மேல் நோக்கி உயர்த்தவும். கைகள் இரண்டையும் ஒன்றாக இணைத்த படி மேலே தூக்கி உள்ளங்கைகள் மேலே பார்த்த படி இருக்கவும்.  "
									+ "<br/><br/>2.உடல் எடை முழுவதும் குதிக்காலில் தாங்கி இருக்கும் செய்ய வேண்டும். இந்த நிலையில் 10 வினாடிகள் இருந்த பின்னர் பழைய நிலைக்கு வரவும். இந்த ஆசனத்தை 3 முறை செய்யலாம். கைகளை மேலே உயர்த்தும் போது மூச்சை உள் இழுத்தும், ஆசனத்தின் போது இயல்பான மூச்சிழும், விடும் போது வெளி மூச்சு இருக்க வேண்டும். குதிகால் வலி உள்ளவர்கள் இந்த ஆசனத்தை செய்ய கூடாது. "
									+

									"<br/><br/><b>மனம் :</b> நரம்பு மண்டலம் முழுவதும்.<br/><b>மூச்சின் கவனம் :</b> "
									+ "கைகளை மேலே உயர்த்தும் போது உள்மூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு விடும் போது வெளிமூச்சு. <br/>"
									+ "<b>உடல் ரீதியான பலன்கள் : </b>நுரையீரல் நெஞ்சுப்பகுதி பலம்பெறும். உடல் முழுவதும் இரத்தஓட்டம் சீரடைந்து நரம்பு மண்டலம் வலிமை பெறும்."
									+ " புத்துணர்ச்சி மிகும். மன வலிமை கூடும். நிமிர்ந்த மிடுக்கான தோற்றம் கிடைக்கும்.<br/>"
									+ "<b>குணமாகும் நோய்கள் :</b> ஆஸ்துமா, கூன்முதுகு<br/>"
									+ "<b>ஆன்மீக பலன்கள்</b> : மனம் ஒருமைப்படும்<br/>"
									+ "<b>எச்சரிக்கை :</b> குதிகால் வலி உள்ளவர்கள் செய்யக்கூடாது")));

		} else if (yogaName.equals("yoga_3")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga3)));
			yogaImage.setImageResource(R.drawable.yoga_3);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை</b>"
									+ "<br/>1.உடலை இறுக்கமாக இல்லாமல் தளர்த்தி வைத்துக்கொண்டு நேராக நிமிர்ந்து நிற்க வேண்டும். பின்னர் 2 கால்களுக்கு இடையே ஒரு அடி அகலம் இருக்குமாறு கால்களை விரித்து வைத்துக் கொண்டு கைகளை தோள்பட்டை உயரத்துக்கு நேராக முன்னே நீட்ட வேண்டும்.பின்பு உடலை மெதுவாக கீழே இறக்கி நாற்காலி மீது அமருவது போன்று மெதுவாக உட்கார வேண்டும். "
									+ "<br/><br/>2.முதுகெலும்பு நேராக இருக்குமாறு பார்த்துக் கொள்வதுடன் முன்பக்கமாகவோ, பின்பக்கமாவோ உடலை வளைக்கக் கூடாது. முதுகெலும்பு 90 டிகிரி போன்று நேராக இருக்க வேண்டும். இது தான் உட்கட்டாசனம் ஆகும். முதலில் 5 முதல் 10 வினாடிகள் செய்யலாம். தினந்தோறும் நன்றாக பயிற்சி செய்த பின்னர் 20 முதல் 30 வினாடிகள் வரை செய்ய வேண்டும். "
									+ "<br/><br/>இந்த ஆசனத்தை செய்யும் போது மூட்டுவலி ஏதாவது ஏற்பட்டால் வலி நீங்கிய பின்னரே செய்ய வேண்டும். உட்கட்டாசனம் செய்யும் போது சாதாரண நிலையில் மூச்சை வெளியில் விட வேண்டும். செய்து முடித்த பின்னர் ஆழ்ந்து மூச்சை இழுத்து விட வேண்டும். "
									+ ""
									+ "<br/><br/><b>மனம் :</b> முழங்கால்கள்"
									+ "<br/><b>மூச்சின் கவனம் :</b> இயல்பான மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> பிராண சக்தியினை உயர்த்தும். ஒரு நிமிடம் செய்தால் 4 கி.மீ., தூரம் நடந்த பலன் கிடைக்கும்"
									+ "<br/><b>குணமாகும் நோய்கள் : </b>மூட்டு வலி, கால் வலி, இடுப்பு வலி, முழங்கால் வலி, குதிகால் வலி, சர்க்கரை நோய், யானைக்கால் வியாதி போன்ற வியாதிகள் நீங்கும்"
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> குண்டலினி சக்தியினை எழுப்பும்")));

		} else if (yogaName.equals("yoga_4")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga4)));
			yogaImage.setImageResource(R.drawable.yoga_4);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "விரிப்பின் மீது கால் பாதங்களை ஒன்று சேர்த்து வைத்து நின்று கொள்ள வேண்டும். கைகளால் இடுப்பை பிடித்து கை கட்டை விரல்களால் முதுகை அழுத்தி பின்னோக்கி முடிந்த அளவிற்கு வளைய வேண்டும். இந்த நிலையில் இருக்கும் போது கால் முட்டிகளை வளைக்கக் கூடாது. "
									+ "<br/>1.அப்படியே சாதாரணமாக மூச்சில் 20 எண்ணிக்கையில் இருக்க வேண்டும். பின்னர் மெதுவாக நிமிர்ந்து நின்று பழைய நிலைக்கு வரவும். சிறிது நேரம் ஓய்வு எடுத்த பின்னர் மறுபடியும் செய்ய வேண்டும். "
									+ "<br/><br/>2.இவ்வாறு ஐந்து முறை இந்த ஆசனத்தை செய்ய வேண்டும். இதயநோய் உள்ளவர்கள் இதனை மெதுவாகச் செய்ய வேண்டும்.முதுகெலும்பு தேய்ந்தவர்கள் மற்றும் கழுத்துவலி உள்ளவர்கள் இந்த ஆசனம் செய்ய வேண்டாம். "
									+ ""
									+ "<br/><br/><b>மனம் :</b> முதுகெலும்பு"
									+ "<br/><b>மூச்சின் கவனம் :</b> உடலை வளைக்கும் போது உள்மூச்சு. ஆசனத்தின் போது இயல்பான மூச்சு. தளரும்போது வெளிமூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> உடம்பின் முன்புறத் தசைகள், கெண்டைக்கால் தசைகள், இடுப்பு, விலாப்பகுதிகளில் உள்ள தசைகள் முறுக்கேறுகின்றன. முதுகுத்தண்டின் வளைந்து கொடுக்கும் தன்மை நீடிக்கின்றது. இது பாதஹஸ்தாசனத்தை பூர்த்தி செய்யும் ஆசனமாதலால் அந்த ஆசனத்தின் பலன்களை இதுகூட்டுகின்றது. சுவாச உறுப்புகள் ஓய்வடைகின்றன."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> ஆஸ்துமா கீழ் முதுகுவலி ஆகியவை குணமாகின்றன. தொடை, கெண்டைக் கால் பகுதியில் ஏற்படும் தசைப்பிடிப்பு நீங்குகிறது."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> உடலின் சமநிலை, தன்னம்பிக்கை ஆகியவை அதிகரிக்கின்றது"
									+ "<br/><b>எச்சரிக்கை :</b> இதயநோய் உள்ளவர்கள் இதனை மெதுவாகச் செய்ய வேண்டும். மெலிந்த உயரமான உடல்வாகு அல்லது பலவீனமானவர்கள் அதிகமாய் வளைவதைத் தவிர்க்கவும். அவர்கள் விழாதவாறு கால்களை சற்று அகற்றி வைத்துக்கொண்டு செய்யலாம். முதுகெலும்பு தேய்ந்தவர்கள் மற்றும் கழுத்துவலி உள்ளவர்கள் இந்த ஆசனம் செய்ய வேண்டாம்."
									+ "")));

		} else if (yogaName.equals("yoga_5")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga5)));
			yogaImage.setImageResource(R.drawable.yoga_5);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.ஆரம்ப நிலை:கால்களை இணைத்து பக்கவாட்டில் உடம்புடன் இணைத்து இருக்கவும்"
									+ "<br/><br/>2.நேராக நின்று கைகளை தரைக்கு இணையாக பக்கவாட்டில் நீட்டவும், உள்ளங்கைகள் தரையைப் பார்த்து இருக்கவும்."
									+ "<br/><br/>3.கைகள் மேல்நோக்கி உயர்த்தவும்,உள்ளங்கைகள் முன்புறம் பார்த்து இருக்கவும்."
									+ "<br/><br/>4.முன்னே குனிந்து இடுப்பின் மேற்பகுதி ஒரே நேர்கோட்டில் தரைக்கு இணையாக இருக்கவும். உள்ளங்கைகள் தரையை பார்த்து இருக்கவும்."
									+ "<br/><br/>5.உள்ளங்கைகளை தரையில் கால்களுக்கு பக்கவாட்டில் பதிக்கவும். நெற்றி முழங்கால்களை தொடவும், முழங்கள் மூட்டு வளையாமல் இருக்கவும்."
									+ "<br/><br/>6.இந்நிலையில் சிறிது நேரமிருந்து ஆரம்ப நிலைக்கு மெதுவாகச் செல்ல வேண்டும்"
									+ "<br/><br/><b>மனம் : </b>வயிற்றுப்பகுதி, முதுகு எலும்பு, கால்கள்"
									+ "<br/><b>மூச்சின் கவனம் :</b> கீழே குனியும் போது வெளிமூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, நிமிரும் போது உள்மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> உடம்பின் பின்புறம் உள்ள எல்லாத் தசைகள், இடுப்பு நரம்பு தொடையில் உள்ள எலும்பைப் பிணைக்கும் தசை நார்கள், தசையைப் பிணைக்கும் தசை நார்கள், கால்கள் ஆகியவை நன்றாக நீட்டப்படுகின்றன. முதுகுத்தண்டு மற்றும் இடுப்பில் உள்ள நரம்புகள் முறுக்கேறுகின்றன. தலைக்குச் செல்லும் இரத்த ஓட்டம் அதிகரிக்கிறது. ஜீரண சுரப்பிகள் நன்கு சுரக்கின்றன. உடலின் சுற்றளவைக் குறைக்கிறது. இடுப்பு மற்றும் இடுப்புக்குக் கீழ் உள்ள அதிக சதைப்பகுதியினை மெலிய வைக்கிறது"
									+ "<br/><b>குணமாகும் நோய்கள் :</b> ஜீரண சம்பந்தமான இரைப்பை, மற்றும் குடல் சம்பந்தமான பிரச்சனைகளுக்கு நல்லது. நீரிழவு நோய் சிகிச்சையில் பலன் அளிக்கிறது. கல்லீரலின் இயக்கம் சீராகிறது."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> படர் விழிப்புணர்வு அதிகரிக்கிறது. தலைக்கு இரத்தம் பாய்வது உணரப்படுகிறது."
									+ "<br/><b>எச்சரிக்கை :</b> அதிக இரத்தஅழுத்தம் அல்லது இதயநோய் உள்ளவர்கள், கழுத்துவலி இடுப்புபிடிப்பு உள்ளவர்கள் இதைச் செய்தல் கூடாது."
									+ "")));

		} else if (yogaName.equals("yoga_6")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga6)));
			yogaImage.setImageResource(R.drawable.yoga_6);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.முதலில் விரிப்பில் நேராக நிற்கவும். வலது கையை தூக்கி இடது புறமாக உடலோடு சேர்த்து சாய்க்கவும். (படத்தில் உள்ளது போல்) கைகளை மேலே உயர்த்தும் போது உள்மூச்சு, சாயும் போது வெளிமூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, நிமிரும் போது உள்மூச்சு என்ற நிலையில் ஆசனத்தை செய்ய வேண்டும். "
									+ "<br/><br/>2.பின்னர் கைகளை இறக்கி பழைய நிலைக்கு வரவும். பின்னர் கைகளை மாற்றி அடுத்த பக்கம் செய்ய வேண்டும். இவ்வாறு இந்த ஆசனத்தை 3 முதல் 5 முறை செய்ய வேண்டும்"
									+ ""
									+ "<br/><b>மனம் : இடுப்பு பகுதி</b>"
									+ "<br/><b>மூச்சின் கவனம் :</b> கைகளை மேலே உயர்த்தும் போது உள்மூச்சு, சாயும் போது வெளிமூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, நிமிரும்போது உள்மூச்சு."
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> முதுகுத்தண்டின் வளையும் தன்மை அதிகரிக்கிறது. பக்கவாட்டு மார்புத்தசைகள் நன்கு நீட்டப்பட்டு இரத்தஓட்டம் அதிகரிக்கிறது. இடுப்பு மூட்டுக்கள் வளையும் தன்மை பெறுகின்றன. நுரையீரல்கள் கொள்ளளவு அதிகரித்து இடுப்பைச் சுற்றியுள்ள அதிகப்படியான கொழுப்பு கரைகின்றது. பாதத்திற்கு நல்லது."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> முதுகுவலியில் இருந்து நிவாரணம் கிடைக்கிறது. மலச்சிக்கல் நீங்குகிறது."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> பக்கவாட்டு விழிப்புணர்வு அதிகரிக்கின்றது. ஓய்வான உணர்வு ஏற்படுகின்றது.")));

		} else if (yogaName.equals("yoga_7")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga7)));
			yogaImage.setImageResource(R.drawable.yoga_7);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.கால்கள் இரண்டையும் விரித்து,கைகளைப் பக்கவாட்டில் விரித்து உள்ளங்கை தரையைப் பார்ப்பது போன்று நிற்க வேண்டும்."
									+ "<br/><br/>2.அப்படியே வலது புறமாக வளைந்து வலது கையால் வலது பாதத்தை தொடவும். முழங்காலை மடக்குவதோ , இடுப்பை அசைப்பதோ கூடாது."
									+ "<br/><br/>3.இடது கையை நேராக மேலே உயர்த்தியிருக்க வேண்டும்."
									+ "<br/><br/>4.5விநாடிகள் இருந்த பிறகு இதே போல் இடது புறமாக வளைந்து இதே முறையில் இடது பக்கம் செய்ய வேண்டும்."
									+ "<br/><br/><b>மனம் :</b> இடுப்பு பகுதி மற்றும் கைகள்"
									+ "<br/><b>மூச்சின் கவனம்:</b> குனியும் போது வெளிமூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, நிமிரும் போது உள்மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள்:</b> உடம்பு முழுவதும் குறிப்பாக முதுகுத்தண்டும் முதுகுத் தசைகளும் நீட்டப்படுகின்றன. மார்பு எலும்புகளுக்கு இடையில் உள்ள தசைகள், தொடைகள், கெண்டைக் கால்கள், முழங்காலுக்குப் பின்புறம் உள்ள தசைகள் முதலியன நன்கு நீட்டப்பட்டு தளர்த்தப்படுகின்றன. அட்ரினல் சுரப்பிகள் நன்கு தூண்டப்படுகின்றன. கல்லீரல், மண்ணீரல், சிறுநீரகங்கள், கணையம் முதலியவை நன்கு அழுத்தப்படுகின்றன. இடுப்பு, இடுப்பின் கீழ்ப்பகுதி மெலிதாகின்றது. கெண்டைக்கால் தொடைப்பகுதி வலுவடைகிறது."
									+ "<br/><b>குணமாகும் நோய்கள்:</b> பாதம், நீரிழிவு நோய்கள், சுவாசக் கோளாறுகள், சிறுநீரகக் கோளாறுகள் ஆகியவற்றிற்கு நல்லது. மலச்சிக்கலை நீக்கி, பசியினை உண்டு பண்ணுகின்றது. முதுகு, கழுத்து, முழங்கை, இடுப்புப் பகுதி, முழங்கால் முதலியவற்றில் உள்ள வலியினைப் போக்குகிறது. வாயுப்பிடிப்பு, கூன்முதுகு முதலியவற்றிற்கும் பலனளிக்கிறது. "
									+ "<br/><b>எச்சரிக்கை:</b> கீழ்முதுகுவலி முழங்கால் வலி உள்ளவர்கள் கவனமாகச் செய்யவும்.")));

		} else if (yogaName.equals("yoga_8")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga8)));
			yogaImage.setImageResource(R.drawable.yoga_8);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.கால்களை ஒரு மீட்டர் அளவு நன்றாக அகட்டி வைத்து உள்ளங்கைகள் கீழ்நோக்கக் கைகளைப் பக்க வாட்டில் நேராக வைத்து நிற்கவும்,மூச்சை இழுக்கவும்."
									+ "<br/><br/>2.இடுப்பை வளைத்து வலது பக்க உள்ளங்கையை இடது காலுக்குப் பக்கத்தில் தரையில் பதிக்கவும். உயர்த்திய இடது கையின் மேல் பார்வையிருக்க மூச்சை வெளிவிடவும்."
									+ "<br/><br/>3.இதே நிலையிலிருந்து மெதுவாக ஆரம்ப நிலைக்கு வரவும். இதே போன்று மறுபுறமும் செய்ய வேண்டும்."
									+ "<br/><br/><b>மனம் :</b> இடுப்பு பகுதி மற்றும் கைகள்"
									+ "<br/><b>மூச்சின் கவனம் :</b> குனியும் போது வெளிமூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, நிமிரும் போது உள்மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள்:</b> முதுகுத்தண்டு முழுவதையும் இது நீட்டி அதை ஆரோக்கியமாக வைக்கிறது. வயிற்றுப்புறத்தில் உள்ள பெரும்பான்மையான உள்ளுறுப்புகள் நன்கு அழுத்தப்பட்டு ஊக்கமளிக்கப்படுகின்றன. முதுகுத்தண்டு, இடுப்பு, இடுப்பின் கீழ்பகுதி ஆகியவற்றின் வளையும் தன்மையினை அதிகரிக்கின்றது. வயிற்றுப் பகுதியில் உள்ள கொழுப்பு கரைக்கப்பட்டு இடுப்புப் பகுதியினை மெலிதாக்குகிறது. முதுகுத் தண்டு சுழற்றப்படுகின்றது. சிறுநீரகங்கள் உரம் பெறுகின்றன. உடல் இலேசாக, புத்துணர்வாக, ஓய்வாக உணர்கிறது. இரத்த ஓட்டம் நன்கு பாய்வது உணரப்படுகிறது. "
									+ "<br/><b>குணமாகும் நோய்கள் :</b> பெரும்பான்மையான வயிற்றுக் கோளாறுகளுக்கு நல்லது. இடுப்பு, மூட்டு தோள்பட்டை, கணுக்கால்கள் ஆகியவற்றின் பிடிப்பு நீங்குகிறது. உடம்புப் பகுதியில் உள்ள தசைகளை இறுக்க தன்மை நீங்கி தளர்கிறது."
									+ "<br/><b>எச்சரிக்கை : </b>தீவிரமான இதய நோய் உள்ளவர்கள், இடுப்பு கீழ் வாயுவினால் அவதிப்படுவோர், இதய நோயாளிகள் இதைச் செய்தல் கூடாது."
									+ "")));

		} else if (yogaName.equals("yoga_9")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga9)));
			yogaImage.setImageResource(R.drawable.yoga_9);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.நேராக நின்று இடது காலை தூக்கி வலது பக்கத் தொடையின் உட்புறத்தில் கால் விரல்கள் கீழ்நோக்கி இருக்குமாறு வைக்கவும்."
									+ "<br/><br/>2.இரண்டு கைகளையும் தலைக்கு மேல் கூப்பிய நிலையில் வைக்கவும்."
									+ "<br/><br/>3.இந்நிலையில் சுவாசத்தை இழுத்து வெளி விடவும்."
									+ "<br/><br/>4.ஆரம்ப நிலைக்கு மெதுவாக வரவும்."
									+ "<br/><br/><b>மனம் :</b> இரத்தஓட்டம் மற்றும் நரம்பு மண்டலங்கள்"
									+ "<br/><b>மூச்சின் கவனம்:</b> இயல்பான மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள்:</b> உயர் மற்றும் குறைந்த இரத்த அழுத்தம் முற்றிலும் கட்டுப்படுத்தப்படும். மனவலிமை மற்றும் தன்னம்பிக்கை கூடும்."
									+ "<br/><b>குணமாகும் நோய்கள்:</b> சிறுநீரகம் நன்றாக வேலை செய்யும். கூடுதல் தொடை சதை குறையும். கால்வலி, பாதவலி, மூட்டுவலி, இடுப்பு வலிகளைக் குறைக்கும். தோள் பட்டை, முதுகு சதைகள் அழகு பெறும். சுவாசப் பணிகள் விலகும். முகம் பொலிவு பெறும்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> கண்களை மூடிச் செய்ய பழகினால் பிரபஞ்சத்தையே கட்டி ஆளலாம்.")));

		} else if (yogaName.equals("yoga_10")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga10)));
			yogaImage.setImageResource(R.drawable.yoga_10);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பில் மண்டியிட்டு உட்காரவும்.கைவிரல்களைக் கோர்த்து உச்சந்தலையை தரையில் வைக்கவும்."
									+ "<br/><br/><br/>2.பிடரியில் விரல்கள் ஒட்டியவாறு குனிந்து அமரவும்."
									+ "<br/><br/>3.வயிறு,இடுப்பு ஆகியவற்றைத் தூக்கி கால்கள் தரையில் படும்படி வைக்கவும்."
									+ "<br/><br/>4.உடலின் எடை யாவும் தலையிலிருக்க வேண்டும். சாதாரணமாக மூச்சு விட்டு கண்களை மூடி இதே நிலையில் சுமார் ஒரு நிமிடம் இருக்கவும். பின் ஆரம்ப நிலைக்கு வரவும்"
									+ ""
									+ "<br/><br/><b>பலன்:</b> மூளை நரம்பு செல்களின் அழிவைத்தடுக்கும், நுண் ரத்தக்குழாய் அடைப்புகள் நீங்கும். தலைக்கு தேவையான ரத்த ஓட்டம் அளிக்கும். கண்பார்வை கோளாறு மறையும். பெரும்பான்மையான காது, மூக்கு, தொண்டை, பாதிப்புகள் அகலும். ஞாபகத்திறன் கூடும். பீனியல், பிட்யூட்ரி, தைராய்டுகளின் சுரப்பிகள் இயக்கம் சீர் பெறும்."
									+ "<br/><b>குறிப்பு:</b> இந்த ஆசனம் செய்து விட்டு, சாதாரண நிலைக்கு திரும்பும் போது தரையிலிருந்து தலையை மிக நிதானமாக உயர்த்தவும், படபடப்பு, இதயத்தின் ரத்த அழுத்த கோளாறு உள்சளவர்கள், முகம், தலை சம்பந்தப்பட்ட அறுவை சிகிச்சை செய்து கொண்டவர்கள் இந்த ஆசனம் செய்யக் கூடாது."
									+ "")));

		} else if (yogaName.equals("yoga_11")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga11)));
			yogaImage.setImageResource(R.drawable.yoga_11);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பில் மல்லாந்து படுத்து கை, கால்களை தளர்த்தி படுத்த நிலையில் இரு பாதங்களை பதித்தவாறு முட்டிகளை மடக்கவும். கைகளை இரு காதருகே கொண்டு வரவும். பாதங்கள் மற்றும் உள்ளங்கைகளை தரையில் ஊன்றி தலை, மூக்கு, இடுப்பு, தொடைகள் மெதுவாக தரையிலிருந்து அரைவட்ட வடிவமாக உயர்த்தி நிற்கவும், 15 வினாடிகளுக்கு பின் மெதுவாக உடம்பை தரையில் கிடத்தியவாறு இரண்டு நிமிட ஓய்வு எடுத்து கொள்ளவும். இதே போல இருமுறை  இந்த ஆசனத்தை பயிலலாம்."
									+ "<br/><br/><b>பலன்:</b> உடம்பின் அனைத்து உறுப்புகளும் சீரான ரத்த ஓட்டம் பெறுகின்றன. கண்பார்வை பிரகாசமடைகிறது. ரத்த அழுத்தம், இதய நோய் உள்ளவர்கள் இந்த ஆசனத்தை கவனமாக கையாளவும்."
									+ "")));

		} else if (yogaName.equals("yoga_12")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga12)));
			yogaImage.setImageResource(R.drawable.yoga_12);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.தரையில் கவிழ்ந்து படுக்கவும், கைகளை நெஞ்சருகே பக்கவாட்டில் கொண்டு வரவும். உள்ளங்கை பகுதியையும், பாதங்கள் இரண்டையும் தரையில் பதித்த படியும் உடலை மேல் நோக்கியபடி முக்கோண வடிவத்தில் உயர்த்தவும். பின் தலையை இரு கைகளுக்கிடையே தொங்க விடவும். இப்படி 20 வினாடிகள் இருந்த பின் நிதானமாக உடலை பழைய கவிழ்ந்த நிலைக்கு கொண்டு வரவும். ரத்த அழுத்தம் உள்ளவர்களும், ஒரு தலை வலி, கண்நீர் முட்டல் போன்ற கண் நோய் உள்ளவர்களும் இதை செய்யக்கூடாது."
									+ "<br/><br/><b>பலன் :</b> தலை, மூளைப்பகுதி, கழுத்து, மார்பு, நுரையீரல் பகுதிகளுக்கு ரத்த ஓட்டம் சீராக அமையும். ஞாபக சக்தி அதிகரிக்கும். கண்பார்வை சீராகும். கை, கால்களின் மூட்டு பலனடையும்."
									+ "")));

		} else if (yogaName.equals("yoga_13")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga13)));
			yogaImage.setImageResource(R.drawable.yoga_13);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.கால்களை முன் நீட்டி உட்காரவும்."
									+ "<br/><br/>2.இடது காலை மடக்கி,நுனிக்கால்கள் மேலிருக்குமாறு புட்டத்திற்கு அடியில் வைக்கவும்.அதே போல் வலது காலையும் செய்யவும்,"
									+ "<br/><br/>3.முழங்கால்களை ஒட்டிவைத்து இரு உள்ளங்கைகளையும் விரித்தவாறு முழங்காலின் மேல் வைக்க வேண்டும்."
									+ "<br/><br/>4.முதுகை நேராக வைத்து வசதியாக உட்காரவும்."
									+ "<br/><br/>5.மூச்சை நன்றாக உள்ளிழுத்து நிறுத்தி நிதானமாக வெளிவிடவும்."
									+ "<br/><br/>6.ஒவ்வொரு காலாக வெளிக்கொணர்ந்து முதல் நிலைக்குத் திரும்பவும்."
									+ "<br/><br/><b>மனம் : </b>அடிவயிறு, தொடைப்பகுதி"
									+ "<br/><b>மூச்சின் கவனம்:</b> இயல்பான மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள்:</b> உடல் உறுதி அடையும். அடிவயிற்றுப் பகுதியில் இரத்தஓட்டம் அதிகமாகும். ஜீரண சக்தி மிக அதிகரிக்கும். முதுகுத் தண்டு வலிமை அடையும். தினமும் செய்தால் காய்ச்சல், மலச்சிக்கல், அஜீரணம் வராது."
									+ "<br/><b>ஆன்மீக பலன்கள்:</b> மனம் உறுதி அடைய இந்த ஆசனம் செய்யலாம். இந்த ஆசனத்தில் தியானம், பிராணயாமம் செய்யலாம்"
									+ "<br/><b>சிறப்பு:</b> இந்த ஆசனத்தை எல்லா நேரத்திலும் செய்யலாம். சாப்பிட்ட பின்னரும் செய்யக்கூடிய ஆசனம்.")));

		} else if (yogaName.equals("yoga_14")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga14)));
			yogaImage.setImageResource(R.drawable.yoga_14);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.விரிப்பில் முழங்காலிட்டு அமரவும். முட்டுக்களை அகலமாக விரித்து உட்காரவும். மார்பு, கழுத்தை சிறிது பின் நோக்கி வளைத்து தலையை பின்புறம் தொங்க விட்ட நிலையில் ஒவ்வொரு கையாக உடலின் பின் பகுதிக்கு கொண்டு சென்று விரல்களை ஊன்றிய குதிகால் பகுதிகளை பிடிக்கவும். வாய்மூடிய நிலையில் மூச்சை நன்றாக உள்வாங்கி வெளியிடவும். 15 வினாடிகள் இவ்விதம் இருந்த பின்பு ஒவ்வொரு கையாக முன் கொண்டு வந்து முழங்காலிட்டு அமரவும். இரண்டு நிமிட இடைவெளிக்குப்பின் மீண்டும் ஒரு முறை இந்த ஆசனம் செய்யலாம். முழங்கால் மூட்டுக்களிலுள்ள நச்சு நீர் குறையும். ஆஸ்த்துமா நோய் குறையும். இது ஒரு மருத்துவ ஆசனமாகும். தைராய்டு கிளாண்டுகள் இயக்கம் சீர்பெற உதவும்."
									+ "<br/><br/><b>மனம் :</b> இடுப்பு பகுதி மற்றும் கழுத்து"
									+ "<br/><b>மூச்சின் கவனம்: </b>வளையும் போது வெளி மூச்சு, நிமிரும் போது உள்மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள்:</b> முதுகுத் தண்டின் வளையும் தன்மையும் மூளைக்கு செல்லும் இரத்த ஓட்டமும் அதிகரிக்கின்றது. வயிற்றின் உள்ளுறுப்புகள் பலமடைந்து விலா எலும்புகள் நன்கு விரிவடைகின்றன."
									+ "<br/><b>குணமாகும் நோய்கள்:</b> முதுகுவலி, சுவாசக் கோளாறுகள், முழங்கால் வலி, இடுப்பு வலி இடுப்பு வாயு பிடிப்பு, கீழ் வாயு வாயுக் கோளாறு, இரைப்பை கோளாறுகள், முதலியவற்றிற்கு நல்லது. தன்னம்பிக்கையினை வளர்க்கிறது. சோம்பலை நீக்கி பயிற்சியாளரைச் சுறுசுறுப்பாகவும் செய்கிறது."
									+ "<br/><b>எச்சரிக்கை:</b> இதய நோயுள்ளவர்கள் கவனமாகச் செய்யவும். குடல்வாயு நோயுள்ளவர்கள் இதைச் செய்தல் கூடாது.")));

		} else if (yogaName.equals("yoga_15")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga15)));
			yogaImage.setImageResource(R.drawable.yoga_15);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.முதலில் விரிப்பில் வஜ்ராசன நிலையில் அமர்ந்து கைகளை மேல் நோக்கி கும்பிட்டபடி தூக்கவும். பின்னர் இயல்பான சுவாசத்தில் முன்னோக்கி குனியவும். அப்போது கைகள் தரையில் தொட வேண்டும். கைகளை மடக்க கூடாது. இந்த நிலையில் சில விநாடிகள் இருந்த பின்னர் பழைய நிலைக்கு வரவும்"
									+ "<br/><br/>2.இவ்வாறு இதை 4 முதல் 5 முறை செய்யலாம். தீவிர முழங்கால் வலி உள்ளவர்கள் கவனமாக செய்யவும். மேலும் இரத்த அழுத்தம் உள்ளவர்கள், இடுப்பில் வாயுப்பிடிப்பு, கழுத்துவலி உள்ளவர்கள் மற்றும் இதய நோயாளிகள் இந்த ஆசனத்தைச் செய்யக் கூடாது. "
									+ ""
									+ "<br/><br/><b>மனம் :</b> வயிறுபகுதி, தலைப்பகுதி"
									+ "<br/><b>மூச்சின் கவனம்:</b> குனியும்போது வெளிமூச்சு. ஆசனத்தின் போது இயல்பான மூச்சு, நிமிரும் போது உள்மூச்சு."
									+ "<br/><b>உடல் ரீதியான பலன்கள்:</b> காலிலுள்ள மூட்டு தசைகளை தளர்த்துகிறது. வயிற்றின் கீழ்ப்புற பகுத அதிக இரத்தஓட்டம் பெறுகின்றது. சிறுநீரகம் வலிமை அடையும். முதுகெலும்பு நெகிழ்வுத் தன்மை பெறும். தலைப்பகுதியில் இரத்தஓட்டம் மிகும். நினைவாற்றல் கூடும். பிட்யுட்டரி, பீனியல், தைராய்டு பாராதைராய்டு போன்ற சுரப்பிகள் தூண்டி விடப்படும். வாழ்நாளை அதிகரிக்கும். தாது பலவீனத்தை சீராக்கும்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> அதிக இரத்த அழுத்தம், இடுப்பு, வாயுப்பிடிப்பு, இரைப்பை குடல் சம்பந்தமான கோளாறுகளுக்கு மிகவும் நல்லது. நீரிழிவு நோயினைக் கட்டுப்படுத்தும். மலச்சிக்கல் நீங்கும். வாயு சம்பந்தமான பிரச்சினைகள் நீங்கும்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> குண்டலினி சக்தி மேல் எழும்பும். உடல் குளிர்ந்து மனம் அமைதியடைகிறது."
									+ "<br/><b>எச்சரிக்கை :</b> தீவிர முழங்கால் வலி உள்ளவர்கள் கவனமாக செய்யவும். இரத்த அழுத்தம் உள்ளவர்கள், இடுப்பில் வாயுப்பிடிப்பு, கழுத்துவலி உள்ளவர்கள் மற்றும் இதய நோயாளிகள் இந்த ஆசனத்தைச் செய்யக் கூடாது."
									+ "")));

		} else if (yogaName.equals("yoga_16")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga16)));
			yogaImage.setImageResource(R.drawable.yoga_16);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.கால்களை நீட்டி உட்கார வேண்டும்."
									+ "<br/><br/>2.வலக்காலை மடக்கி, பாதம் பின்புறம் பார்த்திருக்குமாறு வைக்க வேண்டும்."
									+ "<br/><br/>3.இடக்காலை மடக்கி,இரு பாதங்களையும் ஓன்று சேர்த்து, புட்டங்களைக் கிடத்தி அமர்ந்து வஜ்ராசன இருக்கைக்கு வர வேண்டும்"
									+ "<br/><br/>4.மூச்சினை உள்ளிழுத்தவாறு முழங்கைகளின் உதவியால் மல்லாந்த நிலையில் உடலைக் கிடத்தவும்."
									+ "<br/><br/>5.சாதரண சுவாச நிலையில் இரு கைகளையும் மடக்கி ஒன்று மீது ஒன்று வைத்து,தலையைக் கிடத்தவும்.இந்த நிலையில் ௩௦ விநாடிகள் நீடிக்கவும்."
									+ "<br/><br/>6.பின் ஆரம்ப நிலைக்கு வரவும்."
									+ "<br/><br/><b>மனம் :</b> தொடைப்பகுதி"
									+ "<br/><b>மூச்சின் கவனம்:</b> சாயும்போது வெளிமூச்சு. ஆசனத்தின் போது இயல்பான மூச்சு, நிமிரும் போது உள்மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள்:</b> முதுகுத்தண்டு, வயிற்று புற உறுப்புகள், இடுப்புப்பகுதி நன்கு நீட்டப்பட்டு உரம் பெறுகின்றது. கூன் முதுகு நிமிரும். தொடை புட்டப்பகுதி நல்ல இரத்த ஓட்டம் பெறுகின்றது. தொடை மற்றும் காலின் விறைப்பு மற்றும் கடினத்தன்மையினை குறைக்கிறது. இடுப்பு கணுக்கால், கீழ்முதுகு ஆகியவை நல்ல இயக்கத்திற்குத் தயாராகும்."
									+ "<br/><b>குணமாகும் நோய்கள்:</b> வெகு நேரம் நின்று கொண்டு வேலை செய்பவர்களுக்கு இந்த ஆசனம் மிக நல்லது. வாயுத்தொல்லை நீங்கும். மலச்சிக்கல் நீங்கும்."
									+ "<br/><b>ஆன்மீக பலன்கள்:</b> முதுகெலும்பின் அடிப்பகுதியில் மறைந்து இருக்கும் ஆற்றல்கள் செயல்படத் தொடங்குகின்றன. தொடர்ந்த பயிற்சியினால் ஓய்வு ஆழமானதாகின்றது."
									+ "<br/><b>எச்சரிக்கை:</b> கழுத்துப் பிடிப்புள்ளவர்கள் இதயக்கோளாறு உள்ளவர்கள் இதை செய்யக்கூடாது.")));

		} else if (yogaName.equals("yoga_17")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga17)));
			yogaImage.setImageResource(R.drawable.yoga_17);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.விரிப்பில் இருக்கால்களையும் நீட்டி உட்கார வேண்டும்."
									+ "<br/><br/>2.கைகளை மேலே கொண்டு வரவும் உள்ளங்கைகள் முன்புறமாகப்  பார்த்திருக்கட்டும்.மூச்சினை உள்ளிழுக்க வேண்டும்."
									+ "<br/><br/>3.மூச்சினை வெளியில் விட்ட வாறு உடலை தரைக்கு இணையாகக் கொண்டு வர வேண்டும். கைகள் நீட்டியவாறு இருக்கட்டும்."
									+ "<br/><br/>4.அப்படியே இரு கைகளாலும் பாதங்களைப் பிடிக்க வேண்டும்."
									+ "<br/><br/>5.பாதங்களைப் பிடித்த்த படியே, தலையை இரு கைகளினூடே செல்ல வைத்து,முகத்தை முழங்காலில் பதியுமாறு வைக்க வேண்டும்"
									+ "<br/><br/>6.சாதாரண சுவாஷத்தில் ஒரு நிமிடம் இந்த நிலையில் இருக்க வேண்டும்.பிறகு 4,3,2 வழியாக ஆரம்ப நிலைக்கு வர வேண்டும்"
									+

									"<br/><br/><b>மனம் :</b> முதுகெலும்பு, வயிறு, கால் நரம்புகள்"
									+ "<br/><b>மூச்சின் கவனம் :</b> குனியும் போது வெளிமூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு நிமிரும்போது உள்மூச்சு."
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> உடம்பின் பின்புறம் முழுவதும் மற்றும் வயிற்றின் முன் பகுதியில் உள்ள தசைகள் நன்கு இழுக்கப்பட்டு வலுவடைகின்றன. இடுப்புப் பகுதியில் உள்ள நரம்புகள் உரம் பெறுகின்றது. உடல் பொதுவாக நல்ல வடிவமைப்பினை பெறுகின்றது. கல்லீரல், கணையம், குடல் இவற்றின் ஜீரணசக்தி தூண்டப்பட்டு அதிகரிக்கிறது. வளரும் வயதினரின் உயரத்தைக் கூட்டுவதில் துணைபுரிகின்றது."
									+ "<br/><b>குணமாகும் நோய்கள்:</b> அஜீரணம், மலச்சிக்கல், இடுப்பு, வாயுப் பிடிப்பு, விந்தணு பலவீனம், மூலநோய், ஜீரணக்கோளாறுகள் முதலியவற்றிற்கான சிகிச்சையில் பலனளிக்கிறது. வயிற்றுப்புறத்தில் உள்ள அதிகபடியான கொழுப்பை குறைக்கிறது."
									+ "<br/><b>ஆன்மீக பலன்கள்:</b> மறைந்திருக்கும் ஆன்மீக சக்தியினை எழுப்புகிறது. சுழுமுனை நாடி சக்தியினை உயர்த்தும்."
									+ "<br/><b>எச்சரிக்கை :</b> அதிக இரத்த அழுத்தம் கழுத்துப் பிடிப்பு, நாட்பட்ட மலச்சிக்கல் உள்ளவர்கள், இதயநோய் உள்ளவர்கள் இதை செய்யக்கூடாது. இந்த ஆசனத்தை அதிக நேரம் செய்தால் ஜீரணக்கோளாறுகளுக்கு வழி வகுக்கும். குறைந்த நேரம் மட்டுமே செய்ய வேண்டும்."
									+ "")));

		} else if (yogaName.equals("yoga_18")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga18)));
			yogaImage.setImageResource(R.drawable.yoga_18);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"இந்த உலகில் என்ன தான் விஞ்ஞானம் முன்னேறினாலும் நமது உடல், மன இயக்கங்களில் சக்தியை ஒரு சேர அதிகரிக்க ரிஷிகள் கூறிய யோகாசன பயிற்சி முறைகளை தான் பின்பற்றுகிறோம். அவ்வழியில் நாமும் யோகம்+ஆசனம் என இருவித பயிற்சிகளை ஒருசேரப் பெறுவோம். நலமுடன் வாழ்வோம்."
									+ "<br/><br/><b>யோகாசனம் செய்யும் முன் தெரிந்து கொள்ள வேண்டிய முக்கிய விஷயங்கள் :</b>"
									+ "தடித்த அதே சமயம் மிருதுவான துணி விரிப்பில் அமர்ந்து யோகாசனம் செய்வது நலம். மஞ்சள் காமாலை போன்று நோயால் பாதிக்கப்பட்டவர்கள் 3 மாத காலத்திற்கு பின்னும், உடலில் எந்த பாகத்தில் அறுவை சிகிச்சை செய்திருப்பவர்கள் 6 மாத காலத்திற்கு பின்னும் பயிற்சி செய்ய வேண்டும். பெண்களைப் பொறுத்த வரை மாதவிடாய் காலத்திலும், கர்ப்பம் தரித்த காலங்களிலும் பயிற்சி மேற்கொள்ளக்கூடாது. முதலில் சித்த பத்மாசனம் பற்றி தெரிந்து கொள்வோம்."
									+ "<br/><br/><b>செய்முறை : </b>1.முதுகை வளைக்காமல், தலை நிமிர்ந்து அமர்ந்து கழுத்தை நேராக வைத்துக் கொள்ளவும். வலது காலை மடித்து இடது தொடைமீதும், இடது காலை மடித்து வலது தொடைமீதும் வைக்கவும். இடது கையின் மேல் வலது கையை திறந்த நிலையில் மேல் நோக்கி வைக்கவும், கண்களை மெதுவாக மூடி அதன் பார்வை மையம் இரு புருவங்களுக்கு மத்தியில் இருக்க வேண்டும். ஒரே சீராக நிமிடத்திற்கு 14 முதல் 16 தடவை மூச்சை இழுத்து விடவும். இந்த பயிற்சியை காலை 6 மற்றும் மாலை 6 மணியளவில் குறைந்தது 15 நிமிடம் முதல் ஒரு மணி நேரம் வரை செய்யலாம். வெறும் வயிற்றில் ஒரு டம்ளர் தண்ணீர் அருந்தி கொண்டு பயிற்சி செய்வது நலம்."
									+ "<br/><b>பலன் :</b> ரத்த ஓட்டம் சீராக அமையும், மன அமைதி கிடைக்கும்.")));

		} else if (yogaName.equals("yoga_19")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga19)));
			yogaImage.setImageResource(R.drawable.yoga_19);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.முதலில் கால்களை நன்றாக நீட்டி தளர்த்திக் கொண்டு அமர வேண்டும். வலது காலை இடது தொடை பக்கமாகவும், இடது காலை வலது தொடை பக்கமாகவும் படத்தில் உள்ளது போன்று மேல் நோக்கி இருக்குமாறு வைக்க வேண்டும். "
									+ "<br/><br/>2.அதாவது பத்மாசன முறையில் உட்கார்ந்து கொண்டு பின்பு 2 கைகளையும் தரையில் நன்றாக அழுத்தியவாறு 2 கால் முட்டிகளையும் ஊன்றி நிற்க வேண்டும். பின்னர் மெதுவாக உடலை மேல் நோக்கி தூக்கி 2 கைகளையும் கும்பிட்ட நிலையில் வைக்க வேண்டும். "
									+ "<br/><br/>3.இது தான் பர்வத ஆசன முறை ஆகும். இந்த ஆசனத்தை முதலில் சுவரை ஒட்டிய நிலையில் பயிற்சி செய்யலாம். நன்றாக பயிற்சி செய்த பின்னர் வழக்கமான இடத்தில் செய்யலாம்"
									+ ""
									+ "<br/><br/><b>மனம் :</b> தோள்கள்"
									+ "<br/><b>மூச்சின் கவனம்:</b> கைகளை மேலே தூக்கும் போது உள்மூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, கீழே இறங்கும் போது வெளிமூச்சு."
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> தோள்கள் வலிமையடையும். புஜங்கள் மெலிந்து சீராக அமையும். இதயம் வலிமையடையும். இடுப்பு பகுதி ஊளைச்சதை கரையும்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> தோள்களில் படியும் தேவையற்ற அதிக கால்சியம் குறையும் அதிக உடல் எடை குறையும்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> மலை போன்று உறுதியாக மனநிலை அமையும்."
									+ "<br/><b>எச்சரிக்கை :</b> கழுத்து தேய்மானம் உள்ளவர்கள், உயர் இரத்த அழுத்தம் உள்ளவர்கள், இதய நோயுள்ளவர்கள் இந்த ஆசனத்தைச் செய்யக்கூடாது.")));

		} else if (yogaName.equals("yoga_20")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga20)));
			yogaImage.setImageResource(R.drawable.yoga_20);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.முதலில் பத்மாசனத்தில் அமரவும். பின் இரு கைகளையும் மாற்றி பின்னால் பிடிக்கவும். மூச்சை வெளியிட்டுக் கொண்டு குனிந்து நெற்றி தரையில் படும்படி இருக்கவும். 30 விநாடிகள் இருந்து விட்டு மூச்சை உள் இழுத்து சாதாரண நிலைக்கு வரவும். மூன்று முறைகள் இவ்வாறு செய்யவும். ஆரம்ப நிலையில், இரு கைகளையும் பின்புறம் கோர்த்துக் கொண்டு, குனிந்து இந்த ஆசனத்தைச் செய்து வரலாம். "
									+ ""
									+ "<br/><br/><b>மனம் :</b> முதுகெலும்பு மற்றும் அடிவயிற்றுப் பகுதி"
									+ "<br/><b>மூச்சின் கவனம் :</b> குனியும்போது வெளிமூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, நிமிரும் போது உள்மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> முதுகெலும்பு நெகிழ்வுத்தன்மை பெறும். சிறுநீரகம் வலிமை அடையும். தலைப்பகுதியில் இரத்த ஓட்டம் மிகும். ஞாபக சக்தி கூடும். பிட்யுட்டரி, பீனியல் தைராய்டு, பாராதைராய்டு ஆகிய சுரப்பிகள் தூண்டி விடப்படும். வாழ்நாள் அதிகரிக்கும். மாணவர்களுக்கு மிகவும் ஏற்ற ஆசனம்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> மலச்சிக்கல் நீங்கும். கர்ப்பப்பை பிரச்சனைகள் நீங்கும். நீரிழிவு நோய் நீங்கும்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> மனம் கட்டுப்படும். குண்டலினி சக்தி மேல் எழும்பும்."
									+ "<br/><b>எச்சரிக்கை :</b> இந்த ஆசனத்தை உயர் இரத்த அழுத்தம் உள்ளவர்கள், இடுப்பு வலி உள்ளவர்கள், இதய நோயாளிகள் செய்யக்கூடாது."
									+ "")));

		} else if (yogaName.equals("yoga_21")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga21)));
			yogaImage.setImageResource(R.drawable.yoga_21);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.முதலில் விரிப்பில் கால்களை நீட்டி உட்கார வேண்டும். பின்னர் இடக்காலின் முழங்காலை மடித்து பின்புறமாகக் கொண்டு சென்று இடக்காலின் மீது அமரவும். முழங்கால் தரைமீது இருப்பது போல வைக்கவும். "
									+ "<br/><br/>2.வலக்காலை வளைத்து,இடக்காலுக்கு மறுபுறம் கொண்டு செல்லவும், அப்போது வலது பக்க முழங்கால்,இடது பக்க முழங்காலுக்கு மேலாக இருக்க வேண்டும். வலது பாதத்தை இடது புட்டத்திற்கு அருகில் கொண்டு வர வேண்டும். வலது பக்க முழங்கையை மடித்து, கீழ்ப்புறமாக வளைத்து, முதுகுப்புறம் கொண்டுவரவும். "
									+ "<br/><br/>3.இடக்கையை வளைத்துத் தலைக்கு மேலாகப் பின்புறம் கொண்டு செல்லவும். மூச்சை உள்ளிழுத்து கைகளின் விரல்களை ஒற்றை ஒன்று பிடிக்க வேண்டும். இந்த நிலையில் சுவாசம் இயல்பாக இருக்கட்டும். இந்த நிலையில் 15 விநாடிகள் இருந்தபடி மூச்சினை நன்றாக இழுத்து விடவும்"
									+ "<br/><br/>4.பின்னர் மெதுவாக மூச்சை வெளியில் விட்டு,பிடித்த விரல்களை விட வேண்டும். பின்புறம் கைகளை மெதுவாக எடுத்து முன்புறம் கொண்டு செல்லவும். மேலே உள்ள வலக்காலை மெதுவாக நீட்டவும். இடக்காலை நீட்டி ஆரம்ப நிலைக்குக் கொண்டு வரவும். வலக்காலை முதலில் மடக்கியும் இதனைச் செய்யலாம். இவ்வாறு 3 முதல் 5 முறை செய்யலாம்"
									+ ""
									+ "<br/><br/><b>மனம் :</b> தோள்கள், மார்பு புஜங்கள்"
									+ "<br/><b>மூச்சின் கவனம் :</b> இயல்பான மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> மார்பு விரிந்து நுரையீரல்கள், இதயம் வலுவடையும்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> பசியின்மை நீங்கும். எலும்புகள் மற்றும் மூட்டுகள் வலிமை பெறும். மூட்டு வீக்கம் சம்பந்தமான நோய்கள் குணமடையும். தசைப்பிடிப்பு நீங்கும். மூலபந்தம் நடைபெறுவதால் மூல நோயும் குணமாகும்."
									+ "<br/><b>எச்சரிக்கை :</b> இந்த ஆசனத்தை கழுத்து தேய்மானம், முதுகெலும்பு தேய்மானம் உள்ளவர்கள் செய்யக்கூடாது.")));

		} else if (yogaName.equals("yoga_22")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga22)));
			yogaImage.setImageResource(R.drawable.yoga_22);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.கால்களை நீட்டி, முதுகெலும்பு நேராக இருக்கும்படி நிமிர்ந்து உட்கார்ந்துகொள்ளுங்கள். கைகளைத் தொடைக்குப் பக்கத்தில், உடலுக்குப் பக்கவாட்டில் வைத்துக்கொள்ளவேண்டும். கைவிரல்கள் முன்பக்கம் பார்த்து இருக்கவேண்டும். கைகள் லேசாக தரையைத் தொட்டுக்கொண்டிருக்கவேண்டும். "
									+ "<br/><br/>2.துவக்க நிலையிலிருந்து வலக் காலை மடக்கி, வலக் கால் பாதம், இடக் காலின் மூட்டுக்குப் பக்கத்தில் தரையில் பதிந்திருக்கும்படி வைக்கவேண்டும். வலக் கையை பின்னால் கொண்டுவந்து, வலக் கை விரல்கள் வெளிப்புறம் பார்த்து அதாவது முதுகுக்கு எதிர்ப்புறமாக இருக்கும்படி திருப்பி, முதுகுக்கு அண்டை கொடுத்தபடி வைத்துக் கொள்ளவும். "
									+ "<br/><br/>3.இடக்கையை மெல்ல முன்னெடுத்து வந்து வலக்காலின் (மடக்கி வைத்திருக்கும் கால்) கட்டை விரலைப் பிடித்துக்கொள்ள வேண்டும். (வலக் காலின் இடப்பக்கமாக இருக்கும்படி பார்த்துக்கொள்ளுங்கள்) வயிற்றை உள்ளிழுத்தபடி இடுப்பு, முதுகு, தலை மூன்றையும் ஒருசேர வலப்புறமாகத் திருப்பவும். "
									+ "<br/><br/>4.இப்போது நம் பார்வை வலப் புறத் தோள்மீது இருக்கும். இதுவே வக்ராசனம். இந்த நிலையில் சில விநாடிகள் இருந்த பின்னர் பழைய நிலைக்கு வரவும். இவ்வாறு 5 முதல் 7 முறை செய்ய வேண்டும். குடல்வாயு (ஹெர்னியா நோய்) உள்ளவர்கள் இந்த ஆசனத்தை செய்தல் கூடாது. "
									+ ""
									+ "<br/><br/><b>மனம் :</b> இடுப்பு முதுகெலும்பு"
									+ "<br/><b>மூச்சின் கவனம் :</b> இயல்பான மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> உடலின் பக்கவாட்டைச் சுழற்றுவதற்கு சாத்தியமாகிறது. முதுகெலும்பு முழுவதும் நீட்டப்பட்டு ஊக்கமடைகிறது. கீழ்முதுகின் வளையும் தன்மை அதிகரிக்கின்றது. முதுகுத் தண்டு நரம்பின் ஆரோக்கியம் பாதுகாக்கப்படுகின்றது. கல்லீரல், மண்ணீரல், கணையம், குடல்கள், சிறுநீரகப்பை ஆகியவை நன்கு அழுத்தப்படுகின்றன. பாலணுச் சுரப்பிகள் தூண்டப்படுகின்றன. கணைய நீர், அட்ரினலின் ஆகிய சுரப்பிகள் நன்கு சுரக்கின்றன. தொடைப்பகுதி வலிமை அடையும்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> மலச்சிக்கல், அஜீரணம், நீரிழிவு நோய், சிறுநீரகக் கோளாறுகள், விரிவடைந்த அல்லது சுருங்கிய கல்லீரல் மண்ணீரல் முதுகின் பின்புறம் ஏற்படும் வலி, இடுப்பு மூட்டுக்களில் வலி, உடல் பருமன், வயிற்றுப் பொருமல் முதலானவற்றிற்கு நல்லது. இடுப்பைச் சுற்றியுள்ள சதையினைக் குறைக்கிறது. "
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> சோம்பலை அகற்றி யோகி மத்ஸ்யெந்திரர் என்ற மஹான் அடைந்த நிலையை அடைய உதவுகின்றது. சூட்சும நாடி திறக்கப்பட்டு குண்டலினி சக்தி மேல் எழும்."
									+ "<br/><b>எச்சரிக்கை :</b> குடல்வாயு (ஹெர்னியா நோய்) உள்ளவர்கள் இந்த ஆசனத்தை செய்தல் கூடாது.")));

		} else if (yogaName.equals("yoga_23")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga23)));
			yogaImage.setImageResource(R.drawable.yoga_23);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.முழங்காலை மடக்கி மண்டியிட்டு உட்காரவும். வலது முழங்காலை மெதுவாக தூக்கி, இடதுதொடைக்கு பக்கத்தில் நிலைநிறுத்துங்கள். அப்போது உங்களின் வலதுகை,  முதுகை சுற்றிக்கொண்டுபோய், வலது கணுக்காலை தொடட்டும். இடது கை விரகள், மடிந்திருக்கும் இடதுகால் மூட்டில் இருக்கவேண்டும். இந்த நிலையில் முகம் வலப்பக்கமாக திரும்பியிருக்கவேண்டும். இயல்பான சுவாசத்தில் 15 விநாடி இருந்தபின் இதேபோல் பக்கம் மாற்றிசெய்யுங்கள்"
									+ ""
									+ "<br/>ஒட்டு மொத்தமாக இடுப்பு, முதுகு, தோள்பட்டைகள், தலை, கழுத்து, முதலிய உறுப்புகள் இடது புறம் முறுக்கிய படி பார்வையை நேராக செலுத்தியபடி பத்து விநாடிகள் இந்த ஆசனத்தில் இருக்க வேண்டும். முதுகுத்தண்டு திருகப்படுவதால் உடற்சக்கரங்கள் தூண்டுதல் அடைகிறது.  விறைத்த முதுகுத்தண்டு நெகிழும் தன்மையாவதால் முகுள நீர் அழுத்தம் சீர் அடைகிறது. உடல் பருமன் குறையும். மன அழுத்தம் சீரடையும். சிறுநீரக கோளாறு நீங்கும். மொத்தத்தில் உடல், மனம் இரண்டையும் செம்மையாக்கும் அரிய வகை ஆசனம்")));

		} else if (yogaName.equals("yoga_24")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga24)));
			yogaImage.setImageResource(R.drawable.yoga_24);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"காலை 6 மணிக்குள் அல்லது மாலை 6 மணிக்கு மேல் இந்த ஆசனம் செய்ய வேண்டும். வெறும் வயிற்றிலோ அல்லது சாப்பிட்ட 3 மணி நேரத்திற்கு மேல் செய்யலாம். "
									+ "<br/><br/><b>செய்முறை :</b>1. அமர்ந்த நிலையில் கை கால்கள் இணைந்த செயல் ஆசனம். இயல்பான மூச்சுடன் நமது முழு சிந்தனையும் காதை நோக்கி இருக்க வேண்டும். இடது கால் நீட்டப்பட்டு, வலது காலை மடித்து, வலது பாத கட்டை விரலை வலது கையால் பிடித்து பாதத்தை வலது காதருகே கொண்டு செல்ல வேண்டும். இப்படி வலம் இடம் மாற்று முறையில், கை மற்றும் கால்களை எதிர்புறம் மாற்றி செய்யப்படுவதாகும்."
									+ "<br/><br/><b>பலன் :</b> செவிப்பறை, காது குருத்தெலும்பு சம்பந்தப்பட்ட நோய், காது அடைப்பு, காதில் இரைச்சல், கேட்கும் திறன் குறைவு, காதில் சீழ் வடிதல் ஆகிய காது சம்பந்தப்பட்ட அனைத்து நோய்களும் குணமாகும். காது கேட்கும் சக்தி அதிகரிக்கும்."
									+ "")));

		} else if (yogaName.equals("yoga_25")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga25)));
			yogaImage.setImageResource(R.drawable.yoga_25);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பில் சம்மணமிட்டு அமர்ந்து, விழிகளை திறந்து மூச்சை இயல்பாக விடவும். பிறகு சம்மண நிலையிலிருந்து கால்களை பிரிந்து, வலது காலை அமர்ந்த நிலையில் உள்பக்கம் மடித்து, இடது கால் பாதத்தை கழுத்தின் பின்னால் பிடரியில் படும்படி வைக்கவும். இருகைகளை நெஞ்சருகே வணங்கிய நிலையில் வைக்கவும். இந்த ஆசனம் செய்யும் போது நமது எண்ணத்தை முதுகு தண்டெலும்பில் கீழிருந்து மேல் நோக்கியிருக்கும்படி செய்யவும். அடுத்து இடக்கால் நிலையை வலது காலுக்கும், வலது கால் நிலையை இடது காலுக்கும் மாற்றி செய்யலாம்."
									+ "<br/><br/><b>பலன் :</b> இடுப்பு, முழங்கால் பந்து கிண்ணங்கள், அவைகளை இணைக்கும் தசை நார்கள், ரத்தக்குழாய்கள் சீரடைகிறது. முதுகெலும்பு வளையங்களின் இடையே உள்ள ஜவ்வுப்பகுதி சீரடைகிறது. சர்க்கரை நோயாளிகள் பாதம், கால் விரல்களின் பாதிப்பு குறைகிறது. மாலை நேரங்களில் 15 நிமிடம் செய்வது ஏற்றது. எவ்வித அறுவை சிகிச்சை செய்தவர்களும் 6 மாத காலத்திற்கு பின் இந்த பயிற்சியை செய்யலாம்")));

		} else if (yogaName.equals("yoga_26")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga26)));
			yogaImage.setImageResource(R.drawable.yoga_26);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.விரிப்பின் மீது கால்களை நீட்டியபடி உட்கார்ந்து, பின் இரு பாதங்களையும் உள்பக்கமாக ஒட்டியபடி இணைக்கவும். இரு கைகளாலும் சேர்த்து கால்களை உள்பக்கமாக இழுத்து உடலை உயர்த்தி, கட்டை விரல் தெரிய கால்களில் மேல் சின் முத்திரையிட்டு வைக்கவும். ஆசனம் செய்யும் போது நமது சிந்தனையை முதுகுத்தண்டின் மீது செலுத்தவும் காலை, மாலை இரு வேளைகளிலும் செய்யலாம். ஒவ்வொரு தடவையும் 30 விநாடிகள் செய்வது நலம்."
									+ "<br/><br/><b>பலன் :</b> ஆண்மைக்குறைவு, ஆண்மலடு நீங்கி பெரிதும் பலனளிக்கும். உடல் உஷ்ணம் நீங்கி, மன உளைச்சல்கள் நீங்கும். யானைக்கால் விரைவில் குணமாகும். பெண்கள் மாதத்தில் 5 நாட்களும், கருவுற்ற காலங்களிலும் செய்யக்கூடாது.")));

		} else if (yogaName.equals("yoga_27")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga27)));
			yogaImage.setImageResource(R.drawable.yoga_27);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.நல்ல பாம்பு படம் எடுப்பது போல் தோற்றமளிக்கும். இதில் முதுகெலும்பு பின்புறம் வளைகிறது. சர்ப்பாசனம் என்றும் கூறலாம். செய்முறை. குப்புறப்படுக்கவும், கால்களை இரண்டும் சேர்ந்து இருக்கட்டும். முகவாய்க் கட்டை தரையில் படிந்திருக்க வேண்டும். "
									+ "<br/><br/>2.இரு உள்ளங்களைகளையும் மார்புக்கு அருகில் பக்க வாட்டில் வைத்து அழுத்தி மூச்சை நன்கு உள்ளிழுத்துக் கொண்டு பாம்பு படம் எடுப்பது போல மெதுவாக தலையையும், மார்பையும் படிப்படியாக உயர்த்தவும். "
									+ "<br/><br/>3.தொப்புளுக்கு கீழ் உள்ள பாகம் தரையில் படிந்திருக்க வேண்டும். இந்நிலையில் 30 விநாடிகள் இருக்கலாம். பிறகு மெதுவாக படிப்படியாக ஆரம்ப நிலைக்கு வரலாம். இதை 2 முறை செய்தால் போதும். "
									+ ""
									+ "<br/><br/><b>மனம் :</b> முதுகெலும்பு, அடிவயிறு"
									+ "<br/><b>மூச்சின் கவனம் :</b> உடலை உயர்த்தும் போது உள்மூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, உடலை இறக்கும்போது வெளிமூச்சு."
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> எடை குறையும். மேற்புற முதுகெலும்பு வளைந்து கொடுக்கும் தன்மையுடையதாகவும், உறுதியானதாகவும் ஆகிறது. மார்புத்தசைகள் விரிவடைந்து முதுகுதண்டு நரம்புகள்  ஊக்கமடைகின்றன. இளமைத் தன்மை நீடிக்கும்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> அதிகவேலைப் பளுவினால் வரும் முதுகுவலி, கழுத்துவலி, கழுத்துப் பிடிப்பு கூன் முதுகு, நுரையீரல் அலர்ச்சி, ஆஸ்துமா, ஜீரணக் கோளாறுகள், வயிற்றுக் கொழுப்பு போன்றவற்றை சரி செய்கின்றது. ஜீரணசக்தி குடலின் இயக்கம் ஆகியவை அதிகரிக்கின்றன. சர்க்கரை நோய் குணமாகும்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> குண்டலினியின் எழுச்சி உடல் அளவில் வெப்பம் மற்றும் ஆற்றல் வெளிப்பாடாக உணரபடுகின்றது"
									+ "<br/><b>எச்சரிக்கை :</b> குடல்வாயு, அதிக இரத்தஅழுத்தம் உள்ளவர்கள் செய்தல் கூடாது."
									+ "")));

		} else if (yogaName.equals("yoga_28")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga28)));
			yogaImage.setImageResource(R.drawable.yoga_28);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.முதலில் தரையில் குப்புறப்படுக்க வேண்டும். அடிவயிறு, மார்பு, மற்றும் முகவாய்க்கட்டை தரையில் படுமாறு இருக்க வேண்டும். கைகள் தரையில் இருக்க வேண்டும். உள்ளங்கைகள் மேல் நோக்கி பார்த்தபடி இருக்க வேண்டும். கா‌ல்களை மு‌ட்டியை மடி‌க்காம‌ல் பூமியிலிருந்து 40 டிகிரிக்கு உயர்த்த வேண்டும். "
									+ "<br/><br/>2.கா‌ல்களை உயர்த்தி சாதாரண மூச்சில் 15 எண்ணிக்கைகள் இருக்கவும். மேலே தூக்கிய கால்கள் மெதுவே கீழே இறக்கப்படும் வரை மூச்சை முழுவதும் வெளியே விட வேண்டாம். இர‌ண்டு கா‌ல்களையு‌ம் ‌வி‌ரி‌ப்‌பி‌ன்‌‌மீ‌து கொ‌ண்டு வரு‌ம் போது மூ‌ச்சை ‌விடவு‌ம். "
									+ "<br/><br/>3.இதுபோல் ஐந்து முறை செய்ய வேண்டும். கா‌ல்களை ‌வி‌ரி‌ப்‌பி‌ன் ‌மீ‌து வை‌க்கு‌ம் போது ‌நீ‌ங்க‌ள் காலை தூ‌க்கு‌ம் போது எ‌‌ந்த இட‌த்‌தி‌ல் இரு‌ந்ததோ அதே இட‌த்‌தி‌ற்கு ‌மீ‌ண்டு‌ம் கொ‌ண்டு வ‌ந்து ‌பி‌ன்ன‌ர் சவாசன ‌நிலை‌க்கு‌ப் போகலா‌ம். "
									+ "<br/><br/>"
									+ "<b>மனம் :</b> முதுகெலும்பு, அடிவயிறு, கால்கள், தொடைகள்"
									+ "<br/><b>மூச்சின் கவனம் :</b> கால்கள் உயர்த்தும் போது உள்மூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, இறக்கும் போது வெளிமூச்சு."
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> உடல் எடை குறையும். அட்ரினல் சுரப்பி நன்கு வேலை செய்யும். புஜங்காசனத்தின் பலன்களை இது பூர்த்தி செய்கிறது. இடுப்பு, முதுகின் கீழ்ப்பகுதி, இடுப்பெலும்புக்கூடு, வயிறு, தொடை, சிறுநீரகம், கால்கள் ஆகியவை ஊக்கமடைகின்றன. கணையம் நன்கு செயல்படுகின்றது. கல்லீரல், பித்தப்பை, சிறுநீரகங்களில் கல் அடைப்பு ஏற்படாது"
									+ "<br/><b>குணமாகும் நோய்கள் :</b> மலச்சிக்கல், வாயுத்தொல்லை, நீரிழிவு, இடுப்பு வாயுப்பிடிப்பு ஆகியவை குணமாகும். கர்ப்பப்பை பிரச்சனைகள் தீரும். விரை வீக்கம் நீங்கும். சுவாச பிரச்சனைகள் நீங்கும்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> உடல் லேசாக சுறுசுறுப்பானதாக, நன்கு செயல்படக்கூடியதாக ஆகிறது. புலன்களைக் கட்டுப்படுத்த உதவுகிறது"
									+ "<br/><b>எச்சரிக்கை :</b> இந்த ஆசனத்தை சிறுநீரகக் கோளாறினால் அவதிப்படுவோர், குடல்வாயு மற்றும் அதிக இரத்த அழுத்தக்காரர்கள் இந்த ஆசனத்தை செய்தல் கூடாது.")));

		} else if (yogaName.equals("yoga_29")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga29)));
			yogaImage.setImageResource(R.drawable.yoga_29);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.முதலில் விரிப்பில் கால்கள்,கைகள் சேர்ந்து இருக்கும்படி குப்புற படுக்கவும். கைகள் பக்கவாட்டில் வைத்துக் கொள்ளவும். கைகளால் கணுக்கால்களை பிடித்து மெதுவாக மூச்சை உள்ளிழுத்து தலையையும், உடலையும் தூக்கவும்."
									+ "<br/><br/>2.வில் போல் வளைக்கவும். அடிவயிறு மட்டும் தரையை தொட்டுக் கொண்டிருக்கவும். இந்த நிலையில் இயல்பான சுவாசத்தில் சில நொடிகள் இருக்கவும். "
									+ "<br/><br/>3.பின் மூச்சை வெளிவிட்டு நிதானமாக இயல்பான நிலைக்கு திரும்பவும். இந்த பயிற்சியை 3 முதல் 5 முறை செய்யவும். உயர் ரத்த அழுத்தம், அடிவயிறு கோளாறுகள், முழங்கால், இடுப்பு வலி முதுகுவலி உள்ளவர்கள் இந்த ஆசனத்தை தவிர்க்கவும். "
									+ "<br/><br/>"
									+ "<b>மனம் :</b> முதுகெலும்பு அடி வயிறு தொடைப்பகுதி"
									+ "<br/><b>மூச்சின் கவனம் : </b>கால்களையும் உடலையும் உயர்த்தும்போது உள்மூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, விடும் போது வெளிமூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> உடலை மெலிய வைத்து சுறுசுறுப்பு ஆக்குகிறது. இடுப்பை வளைக்க உதவும் ரெக்டி தசைகள் நன்கு ஆரோக்கியம் அடைகின்றன. வயிற்றுப் பகுதியில் உள்ள அதிகக் கொழுப்பு குறைகின்றது. இரத்தக்குழாய் சுத்தமடையும். முதுகு எலும்பு நன்கு வலுப்பெறும். அட்ரினல் சுரப்பி நன்கு வலுப்பெறும். அடிவயிற்றுக்கு நல்ல அழுத்தம் கிடைத்து மலம் மலக்குடலுக்குத் தள்ளப்படும். இனப் பெருக்க மண்டலம் வலிமை பெறும்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> சுவாசக் கோளாறுகள், முதுகுவலி, மூட்டு சம்பந்தமான நோய்கள், நீரிழிவு, இரைப்பை, குடல் சம்பந்தமான பிரச்சினைகள் ஆகியவற்றிற்கு நல்லது. ஜீரண சக்தியினை அதிகப்படுத்துகின்றது. மாதவிடாய்ப் பிரச்சனைகள் தீரும். தூக்க மின்மை விலகும்."
									+ "<br/><b>ஆன்மீக பலன்கள் : </b>சோம்பலை நீக்கி உடலை சுறுசுறுப்பாக்குகிறது"
									+ "<br/><b>எச்சரிக்கை :</b> குடல் வாயு மற்றும் அதிக இரத்த அழுத்தக்காரர்கள் இந்த ஆசனத்தைச் செய்தல் கூடாது. ஆசன நிலையில் ஆடக்கூடாது. இதய நோயாளிகள் இந்த ஆசனத்தை ச் செய்தல் கூடாது.")));

		} else if (yogaName.equals("yoga_30")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga30)));
			yogaImage.setImageResource(R.drawable.yoga_30);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>மனம் : </b>அடி வயிறு"
									+ "<br/><b>மூச்சின் கவனம் :</b> கால்களைத் தூக்கும்போது உள்மூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, இறக்கும் போது வெளிமூச்சு."
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> தொப்பையினைக் குறைக்கும். தொடைகள் வலிமை பெறும். சுவாசம் சீராகும்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b>  ஜீரண உறுப்புகளும், நரம்புகளும் சீராகும்."
									+ "")));

		} else if (yogaName.equals("yoga_31")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga31)));
			yogaImage.setImageResource(R.drawable.yoga_31);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பில் மல்லாந்து படுத்தநிலையில் இரு கால்களையும் இணையாக தலைக்கு மேல் செங்குத்தாக தூக்கவும். இரு கால்களையும் தலைக்கு பின்னால் கொண்டு போய்விடுங்கள். அதனால் இடுப்புபகுதி தூக்கியவாறு இருக்கும். இடுப்பு பகுதியை தூக்கியபின் இரு உள்ளங்கைகளையும் நடுமுதுகில் வையுங்கள். "
									+ "<br/><br/>கால்களை கொஞ்சம் பின்னுக்கு தள்ளி செங்குத்தாக நேர்க்கோட்டில் நிறுத்தவும். உங்களின் கண்கள் மேலிருக்கும் இரு கால்கட்டை விரல்களை பார்க்கட்டும். கீழ்த்தாடைப்பகுதி நெஞ்சில் ஒட்டியிருக்க வேண்டும். கழுத்து பிடரி சரியாய் தரையில் படிய அமையுங்கள். ஆசனத்தின் போது உடலியக்கத்துடன் சுவாசமும் இயல்பாய் இருப்பது அவசியம்"
									+ "<br/><br/>"
									+ "<b>மனம் :</b> இருதோள்கள், கழுத்து"
									+ "<br/><b>மூச்சின் கவனம் :</b> ஆசனங்களின் தாயாக இந்த ஆசனம் திகழ்கிறது. நூறுக்கும் மேற்பட்ட பலன்கள் கிடைக்கும். அனைத்து நோய்களுக்கும் சிறந்த நிவாரணி. தைராய்டை நல்ல நிலையில் வைத்து உடலின் ஆரோக்கியத்தை பாதுகாக்கிறது. இடுப்புப் பகுதியில் உள்ள உறுப்புகளை நல்லவிதமாகத் தூண்டி பலமடையச் செய்கிறது. மூளை நல்ல இரத்தஓட்டம் பெறுகின்றது. கண் பார்வை கூடும். நோய் எதிர்ப்பு சக்தி கூடும்"
									+ "<br/><b>குணமாகும் நோய்கள் :</b> வெரிகோஸ்வைன் என்னும் ரத்தக்குழாய் புடைத்துப் போகுதல். தோல் நோய், ஆஸ்துமா, சைனஸ், காதடைப்பு நீங்கும். மூலநோய், குடல்வாயு, தைராய்டு குறைவினால் ஏற்படும் நோய்கள், உள்ளுறுப்புகளில் பலவீனம், அஜீரணம், மலச்சிக்கல், மாதவிடாய்க் கோளாறுகள் முதலியவற்றிற்கு நல்லது. தூக்கமின்மை சரியாகும். அதிக தூக்கம் குறையும். ஆரம்ப கட்ட ஹெர்னியா கர்ப்பப்பை இறக்கம் சரியாகும். வளர்சிதை மாற்றம் கட்டுப்படும்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> நினைவாற்றல் வளர்கின்றது. மனஒருமைப்பாட்டுக்கும், சமநிலையான மனதிற்கும் நல்லது."
									+ "<br/><b>எச்சரிக்கை :</b> அதிக இரத்த அழுத்தம் உள்ளவர்கள் இடுப்பு கீழ் வாயுவினால் அவதிப்படுவோர், முள்ளெலும்பு நகர்ந்தவர்கள், இதய நோய்கள், கழுத்து பிடிப்பு உள்ளவர்கள் இந்த ஆசனத்தை செய்தல் கூடாது. ஆசனத்தில் இருக்கும் போது தலையினை பக்கவாட்டில் திரும்பி பார்க்ககூடாது."
									+ "")));

		} else if (yogaName.equals("yoga_32")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga32)));
			yogaImage.setImageResource(R.drawable.yoga_32);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பில் பத்மாசனம் நிலையில் அமரவும். பின்பு கால்களை பிரிக்காமல் அப்படியே பின்புறம் சாய்ந்து படுத்துக் கொள்க. இரண்டு கால் மூட்டுக்களும் சற்றும் விலகாமல் தரையில் நன்றாக பதிந்து இருக்க வேண்டும். "
									+ "<br/><br/>முழங்கால்களைப் பின்புறம் தரையில் ஊன்றி முதுகைச் சற்றே வளைத்து, மார்பு மற்றும் இடுப்புப் பகுதி மேல் உயர தலை உச்சி நிலை மட்டும் தரையில் சாய்ந்து தொடும் வகையில் படுக்கவும். கைகளால் பின்பு இருகால் கட்டை விரல்களையும் அழுத்தமாக பிடித்துக் கொள்ளுங்"
									+ "<br/><br/>அப்போதும் கூட பத்மாசனம் கலையக் கூடாது என்பது மிகவும் முக்கியம். சாதாரணமாக மூச்சு விட்டால் போதும். இந்த நிலையில் 15 விநாடிகள் இருந்த பின்னர் பழைய நிலைக்கு வரவும். இவ்வாறு இந்த ஆசனத்தை 5 முறை செய்ய வேண்டும். "
									+ "<br/><br/>"
									+ "<b>மனம் :</b> நுரையீரல்கள், மார்பு"
									+ "<br/><b>மூச்சின் கவனம் :</b> ஆசனத்தில் வேகமான மூச்சு, ஆசனத்தின் போது இயல்பான மூச்சு, மார்பு சுவாசம்."
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> சர்வாங்காசனத்தைப் பூர்த்தி செய்யும் ஆசனமாதலால் அதனுடைய எல்லா பலன்களையும் அதிகரிக்கின்றது. மிக நீண்ட நேர மேசை வேலை செய்வோர்க்கு புத்துணர்வு அளிக்கிறது."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> நீரிழிவு, ஆஸ்துமா, நுரையீரல் நோய்கள் தைராய்டு, பாரா தைராய்டு முதலியவை சரியாகும்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> உடலும் மனமும் மிகவும் இலேசாக, சுறுசுறுப்பாக, புத்துணர்வாக ஓய்வாக ஆகின்றது."
									+ "<br/><b>எச்சரிக்கை :</b>அதிக இரத்த அழுத்தம் உள்ளவர்கள் கழுத்துப் பிடிப்பு உள்ளவர்கள் செய்யக்கூடாது. வலப்பக்கமோ இடப்பக்கமோ சாயாமல் சரியாக உச்சந்தலை தரையில் வைக்கப்பட வேண்டும்."
									+ "")));

		} else if (yogaName.equals("yoga_33")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga33)));
			yogaImage.setImageResource(R.drawable.yoga_33);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.முதலில் மல்லாந்து படுத்துக்கொள்ளவும். பக்கவாட்டில் கைகள் நீட்டியிருக்கப்பட வேண்டும். உள்ளங்கைகள் கீழ் நோக்கி, புறங்கைகள் மேலே இருக்குமாறு வைத்துக்கொள்ள வேண்டும். மூச்சை நன்றாக இழுத்து மெதுவாக விடவும். மூச்சுக்காற்றை வெளியே விடும்போது இரண்டு கால்களையும் ஒன்று சேர்த்து உயர்த்தி மடித்து வயிற்றின் மீதுகொண்டுவரவும். "
									+ "<br/><br/>2.கைவிரல்களை ஒன்று சேர்த்து அல்லது தனித்தனியாக கால் முட்டிகளை பிடித்து வயிற்றில் அழுத்தம் கொடு‌க்கவு‌ம். தலையை உயர்த்தி முகவாய் கட்டையை இரண்டு முட்டிகளுக்கு இடையில் கொண்டு வந்து வைக்கவேண்டும். இதனை ஒவ்வொரு கால்களாகவும் செய்யலாம். சாதாரண மூச்சில் 15வினாடிகள் இருந்து விட்டு கால்களையும் தலையையும் பிரித்து மல்லாந்து படுத்து ஓய்வு எடுக்க வேண்டும். மூன்று முறை செய்து விட்டு இயல்பு நிலைக்கு வரவேண்டும். "
									+ "<br/><br/>"
									+ "<b>மனம் :</b> வயிற்றுப்பகுதி"
									+ "<br/><b>மூச்சின் கவனம் :</b> வயிறு அழுத்தும் போது வெளிமூச்சு, ஆசனத்தின் போது இயல்பாக மூச்சு, விடுபடும் போது உள்மூச்சு."
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> வாயுத்தொல்லை நீங்கி ஜீரண சக்தி அதிகரிக்கும். அபான வாயுத்தொல்லை பெருமளவு நீங்கும். அதிக உடல் எடை தொப்பை குறையும். வயிற்றுப் பகுதியில் இரத்த ஓட்டம் அதிகரிக்கும்."
									+ "<br/><b>குணமாகும் நோய்கள் :</b> சர்க்கரை நோய் கட்டுப்படும். மலச்சிக்கல் நீங்கும்."
									+ "<br/><b>எச்சரிக்கை :</b> கழுத்துவலி உள்ளவர்கள் முதுகெலும்புப் பிரச்சனைகள் உள்ளவர்கள் செய்யக்கூடாது."
									+ "")));

		} else if (yogaName.equals("yoga_34")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga34)));
			yogaImage.setImageResource(R.drawable.yoga_34);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பில் மல்லாந்து படுத்து கால்களை வயிற்றின்மேல் மடித்து உயரத்தூக்கி கைகளின் உதவியால் பிருஷ்டத்தையும் முதுகையும் உயரக் கிளப்பி, முழங்கைகளைத் தரையில் நன்றாக ஊன்றி, விரிந்த இரு கைகளாலும் பிருஷ்டத்தைத் தாங்கி கால்களை நேராக நிமிர்த்தி நிற்கவும்.கண்பார்வை கால் பெருவிரலை நோக்கி இருக்க வேண்டும்."
									+ "<br/><br/>2.ஆரம்பக் காலத்தில் பிறர் உதவியுடன் பிருஷ்ட பாகத்தில் தலையணைகளைத் தாங்கலாகக் கொடுத்து நிற்கலாம். அல்லது சுவரின் ஓரமாகப் படுத்து கால்களால் சுவரை மிதித்து பிருஷ்ட பாகத்தைத் தூக்கி நிறுத்திச் செய்யலாம். காலை விறைப்பாக வைக்காமல் சாதாரணமாக வைக்க வேண்டும். ஒரு முறைக்கு 2 நிமிடமாக 2 முதல் 3 முறை செய்யலாம். "
									+ "<br/><br/>"
									+ "<b>மனம் : இடுப்பு கழுத்து</b>"
									+ "<br/><b>மூச்சின் கவனம்:</b> இயல்பான மூச்சு"
									+ "<br/><b>பலன்கள்:</b> சர்வாங்கசனத்தின் அனைத்துப் பலன்களும் இதில் கிட்டும். இரத்த அழுத்தம் உள்ளவர்களும் இதை செய்யலாம்."
									+ "")));

		} else if (yogaName.equals("yoga_35")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga35)));
			yogaImage.setImageResource(R.drawable.yoga_35);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பில் முதலில் கால்களைக் கொஞ்சமாக பக்கவாட்டில் அகட்டி வைத்து முன் பக்கமாக நீட்டி உட்காரவும். அடுத்து முழங்கால்களைச் சற்று மேலே உயர்த்தி முன் பக்கமாக குனிந்து கொள்ள வேண்டும். பின்பு வலது கையை வலது முழங்காலுக்கு அடியில் நுழைந்து வெளிப்பக்கமாக கொண்டு வர வேண்டும்."
									+ "<br/><br/>2.அதே போல் இடது கைகை இடது முழங்காலுக்கு அடியில் நுழைத்து வெளிப்பக்கமாக கொண்டு வர வேண்டும். அதாவது வலது கை, வலது காலுக்கு செங்குத்தாகவும், இடது கை இடது காலுக்கு செங்குத்தாகவும் இருக்க வேண்டும். அப்போது கால்கள் வளையாமல் இருக்க வேண்டும்"
									+ "<br/><br/>3.இந்த நிலையில் முதுகையும், கழுத்தையும் முன் பக்கமாக ஒன்றாக நீட்டி வயிறு, மார்பு மற்றம் கீழ்த்தாடையைத் தரையில் பதிக்கவும். சுமார் 20 விநாடிகள் சாதாரண மூச்சில் இருந்து பிறகு முழங்கால்களை உயர்த்தி கைகளைத் தளர்த்தி முதுகை நிமிர்த்தி மேலே எழுந்து உட்காரவும். "
									+ "<br/>"
									+ "<br/><b>பலன்கள் :</b> மன அமைதி கிடைக்கும். இடுப்பு எலும்பு, முதுகுத்தண்டு எலும்பு, கழுத்தெலும்பு சம்பந்தப்பட்ட வலி நீங்கும் ரத்தத்தில் சிகப்பணுக்கள் அதிகரிக்கும். பெண்களுக்கு கர்ப்பப்பை சம்பந்தப்பட்ட நோய்கள் குறைந்து, குழந்தை பாக்கியம் கிடைக்க செய்யும்.கருப்பை நோய்களை சரி செய்கிறது. நரம்பு மண்டலத்தை தூண்டச் செய்கிறது. சுக பிரசவம் ஏற்பட உதவி செய்கிறது. ")));

		} else if (yogaName.equals("yoga_36")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga36)));
			yogaImage.setImageResource(R.drawable.yoga_36);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பின் மேல் நோக்கியவாறு (மல்லாந்து) படுத்து கை, கால்களைத் தளர்ந்த நிலையில் வைக்கவும், பின் கால்களை முட்டிவரை மடக்கி, இடுப்பை உயரத்தூக்கி (மேல்நோக்கி) கைகளால் இடுப்பைத் தாங்கி பிடித்து கொள்ளவும். இரு முட்டிக் கால்களை நெற்றியருகே இருக்கும்படி கொண்டு வரவும். பாதங்கள் மேல் நோக்கி இருக்க வேண்டும்"
									+ "<br/><br/>கர்பப்பையில் ஏற்படும் சிறு சிறு ரத்தக்கட்டிகள் மறையும், நச்சு ரத்தம் தேங்கிவிடாமல் வெளியேறும். மாதவிடாய் காலங்களில் ஏற்படும் சூதகவலி ஏற்படாதிருக்கும். அதிக உதிரப்போக்கு, உண்டாகாமலும், காலந்தவறாத மாதவிடாய் ஏற்படும். அனைத்து குடல் உபாதைகள் நீங்குவதோடு, குடலிறக்க நோயும் வராதிருக்கும். இது பெண்களுக்குரிய முக்கியமான ஆசனமாகும்."
									+ "")));

		} else if (yogaName.equals("yoga_37")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga37)));
			yogaImage.setImageResource(R.drawable.yoga_37);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/> "
									+ "1.விரிப்பில் கைகால்களை தளர்த்திய நிலையில் விரிப்பில் மல்லாந்து படுக்கவும். இரு கால்களை நீட்டிய நிலையில் மடித்து இரு பாதங்களை பின்னியவாறு தலையணையாக்கி அதன் மேல் தலையை கிடத்தி கழுத்தின் பின்புறம் நன்கு பதியும்படி வைக்கவும்."
									+ "<br/><br/>2.இரு தொடைகளின் இடையே உள்ளிருந்து கைகளை வெளியே கொண்டு வரவும். பின் விரல்களை கோர்த்து பின்னிய கைகளின் உள்ளே உட்காரும் பாகத்தை தாங்கிய படி ஆசனம் அமைக்கவும் ஆரம்பத்தில் 3 முதல் 10 நிமிடங்களும், பின் படிப்படியாக கால அளவைக் கூட்டியவாறு விரும்பு காலம் வரை இந்த ஆசனத்தில் இருக்கலாம். "
									+ "<br/><br/>3.கால்களை மூடிய நிலையில் மிக இயல்பாக மூச்சை இழுத்து விடவும். பயிற்சியாளரின் நேரடி கண்காணிப்பின்றி இந்த ஆசனத்தை செய்ய முயற்சி செய்ய கூடாது. "
									+ "<br/><br/><b>பலன் :</b> உடலில் உள்ள ஒட்டு மொத்த சுரப்பிகளை ஒரு சேர சீராக இயக்கும். அடைபட்ட வியர்வைக் கண்கள் திறக்கப்பட்டு, உடலின் துர்நீர் வெளியேற்றப்படும். ரத்தக்குழாய்களில் அடைப்புகள் இருந்தால் அவை நீங்கி ரத்தம் சீராக பாயும். மனதை அமைதி அடைய செய்யும். ஆசனங்களில் அரசி என இது புகழப்படுகிறது."
									+ "")));

		} else if (yogaName.equals("yoga_38")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga38)));
			yogaImage.setImageResource(R.drawable.yoga_38);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.விரிப்பில் பத்மாசனத்தில் அமரவும். இப்படி அமர்ந்த நிலையில் உடலை அப்படியே பக்கவாட்டில் வலதுபுறம் சாய்த்து வலது முட்டிக் கையை தரையில் ஊன்றி கை விரல்களால் தலையின் வலப்புற கன்னம், காதுகளை தாங்கியபடி கிடக்கவும்."
									+ "<br/><br/><b>பலன் :</b>உடல் மேல்நோக்கிய பிறை சந்திரன்போல் அமைவதால் நாற்பதாயிரம் நரம்புகள் வரை தூண்டப்பட்டு  மன அமைதி கிடைக்கும். உடல் உஷ்ணம் தணியும். ஆழ்ந்த உறக்கம் ஏற்படும்."
									+ "")));

		} else if (yogaName.equals("yoga_39")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga39)));
			yogaImage.setImageResource(R.drawable.yoga_39);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>செய்முறை:</b><br/>"
									+ "1.விரிப்பின் மீது மல்லாந்து படுத்து, இரு கால்களை முட்டி வரை குத்துக்காலிட்டு மடக்கவும். தலை, கழுத்து, தோள், பாதங்கள் தரையிலிருக்கும் படி செய்யவும். இடுப்பு, முதுகு, இருதொடைகள் உயர்த்தி, கைகளால் இடுப்பை தாங்கி கொள்ளவும். காலை வேளையில் இயல்பான மூச்சுடன் இரண்டு தடவை 15 வினாடிகள் செய்யவும்."
									+ "<br/><br/><b>பலன் :</b> அதிக உடல் எடை கொண்டவர்களும், தொடர்ந்து வாகனம் ஓட்டுபவர்களும், ஒரே இடத்தில் உட்கார்ந்து பணிபுரிபவர்களும் இதை செய்யலாம். இதனால் ஏற்படும் இடுப்பெலும்பு தேய்மானம். முதுகு தண்டு எலும்பு தேய்மானம், அதனால் ஏற்படும் வலி ஆகியவற்றிலிருந்து பாதுகாப்பு தரும். இந்த ஆசனம் செய்து வந்தால் கழுத்துப்பட்டை மற்றும் இடுப்பு பட்டை அணிவதிலிருந்து விடுதலை கிடைக்கும்."
									+ "")));

		} else if (yogaName.equals("yoga_40")) {
			playVideo.setVisibility(Button.INVISIBLE);
			title.setText(TamilUtil.convertToTamil(TamilUtil.TSCII,
					getString(R.string.yoga40)));
			yogaImage.setImageResource(R.drawable.yoga_40);
			content.setText(Html.fromHtml(TamilUtil
					.convertToTamil(
							TamilUtil.TSCII,
							"<b>ஓய்வாசனம் சவாசனம் (முழுமையான தளர்வுப் பயிற்சி)</b>"
									+ "<br/><br/>சவ என்றால் பிறம். உச்சந்தலையில் உடல் ஒரு சவம் போன்று தோன்றுகிறது. இந்த ஆசனம் செய்வோர் உள்ளேயும், வெளியேயும் ஏற்படும் எல்லாத் தூண்டுதல்களுக்கும் ஆட்படாமல் எந்த எதிர்ச் செயலுமின்றி பிணம் போல் ஆக வேண்டும் என்பதைக் குறிக்கிறது."
									+ "<br/><br/><b>மனம் :</b> கால் கட்டை விரல்களில் துவங்கி மற்றும் உடல் முழுவதும் பரவி இறுதியில் மூளை (தலை) வரை"
									+ "<br/><b>மூச்சின் கவனம் :</b> ஆழ்ந்த மூச்சு"
									+ "<br/><b>உடல் ரீதியான பலன்கள் :</b> ஆசனங்கள் முடித்த பின் கண்டிப்பாக இந்த ஆசனம் செய்ய வேண்டும். 5 முதல் 20 நிமிடம் வரை செய்யலாம். அற்புதமான பலன்களைக் கொடுக்கக்கூடியது. மூளைக்கு நல்ல ஓய்வு. உடல் முழுவதையும் உறுதிப்படுத்தி ஊக்கமளிக்கிறது. எல்லாத் தசைகளும் மூட்டுகளும் தளர்த்தப்படுகின்றன. தினமும் இருவேளை செய்யலாம். பிரணாயாமம் செய்வதற்கு உடல் ஏற்றதாகிறது. 30 நிமிடப் பயிற்சி 3 மணி நேர ஆழ்ந்த தூக்கத்திற்கு சமமாகிறது"
									+ "<br/><b>குணமாகும் நோய்கள் :</b> அதிக இரத்த அழுத்தம், மனஇறுக்கத்தால் உண்டாகும் தலைவலி ஆகியவற்றால் ஏற்படும் மனநோய் பிரச்சனைகளுக்கு வெகுவாக பலன் அளிக்கிறது. தூக்கமின்மை, சர்க்கரை நோய், இதயநோய், வலி உபாதைகள், நினைவாற்றல், இயலாமை மற்றும் பலவற்றிற்கு இது அற்புதமருந்து. களைப்போ சோர்வோ இருக்கும் போது இப்பயிற்சியினைச் செய்யலாம். ஒலிநாடாவின் உதவியுடனும் செய்யலாம்."
									+ "<br/><b>ஆன்மீக பலன்கள் :</b> மனம் ஆழ்ந்த ஓய்வைப் பெறும். அந்தரங்க யோகப் பயிற்சிக்கு வெகுவாக பயன்படுகின்றது. செய்பவரின் உடல் நலனை அதிகரிக்க செய்கிறது. பஞ்சகோசங்களையும் சுத்திகரிக்கும் ஆசனம் இது. வயது, உடலின் நிலை போன்ற வரம்பின்றி அனைவரும் பயிற்சி மேற்கொள்ளலாம். செய்யும் நேரம் முழுமையும் சுவாசம் மெதுவானதாக, ஆழமானதாக, ஓய்வாக, சீரானதாக ஏககாலத்தில் நிகழ்கிறது. "
									+ "")));

		}

	}

	@Override
	protected void onStop() {
		// TODO Auto-generated method stub
		System.out.println("onStoping the activity");

		super.onStop();
		if (!stopIndicator)
			finish();
	}

	@Override
	protected void onStart() {
		super.onStart();
		// stopIndicator = false;
	}

	@Override
	public void onClick(View v) {
		// TODO Auto-generated method stub
		switch (v.getId()) {

		case R.id.play:
			video = new Intent("android.intent.action.VIDEO");
			video.putExtra("indexValue", yogaName);
			stopIndicator = true;
			startActivity(video);
			break;

		}
	}

	@Override
	public boolean dispatchTouchEvent(MotionEvent me) {
		// Call onTouchEvent of SimpleGestureFilter class
		this.detector.onTouchEvent(me);
		return super.dispatchTouchEvent(me);
	}

	@Override
	public void onSwipe(int direction) {
		String str = "";
		int pos = 0;

		switch (direction) {

		case SimpleGestureFilter.SWIPE_RIGHT:
			if (yogaName.equals("yoga_1")) {

			} else {
				String temp[] = yogaName.split("_");
				pos = Integer.parseInt(temp[1]);
				pos--;
				yogaName = "yoga_" + pos;
				settingValue();
				scrollScreen();
				
			}
			str = "Swipe Right";

			break;
		case SimpleGestureFilter.SWIPE_LEFT:
			if (yogaName.equals("yoga_40")) {

			} else {
				String temp[] = yogaName.split("_");
				pos = Integer.parseInt(temp[1]);
				pos++;
				yogaName = "yoga_" + pos;
				settingValue();
				scrollScreen();
			}
			str = "Swipe Left";
			
			
			break;
		case SimpleGestureFilter.SWIPE_DOWN:
			str = "Swipe Down";
			break;
		case SimpleGestureFilter.SWIPE_UP:
			str = "Swipe Up";
			break;

		}
		//Toast.makeText(this, str, Toast.LENGTH_SHORT).show();
	}

	private void scrollScreen () {
		scroll.post(new Runnable() {
			
			@Override
			public void run() {
				// TODO Auto-generated method stub
				scroll.smoothScrollTo(0, scroll.getTop());
			}
		});
	}
	@Override
	public void onDoubleTap() {
		//Toast.makeText(this, "Double Tap", Toast.LENGTH_SHORT).show();
	}
}
